; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v12 ?v7)
             (pred_5 ?v13 ?v5)
             (pred_2 ?v12 ?v5)
             (pred_12 ?v8 ?v12 )
	     (pred_10 ?v12)
             (pred_11 ?v10)
             (pred_7 ?v13)
             (pred_9 ?v5)
             (pred_4 ?v12)
             (pred_3 ?v13)
             (pred_1 ?v12)
             (pred_6 ))



(:action op_1
:parameters (?v9 ?v3 ?v11 ?v1)
:precondition (and (pred_11 ?v9) (pred_11 ?v3) (pred_7 ?v11) (pred_9 ?v1)
          (pred_8 ?v9 ?v3) (pred_5 ?v11 ?v1)
                   (pred_2 ?v3 ?v1) (pred_10 ?v9) 
                   (pred_4 ?v3) (pred_3 ?v11))
:effect (and  (pred_1 ?v3) (not (pred_4 ?v3))))


(:action op_5
:parameters (?v9 ?v4)
:precondition (and (pred_11 ?v9) (pred_11 ?v4)
               (pred_10 ?v9) (pred_8 ?v9 ?v4) (pred_1 ?v4))
:effect (and (pred_10 ?v4) (not (pred_10 ?v9))))

(:action op_2
:parameters (?v9 ?v11)
:precondition (and (pred_11 ?v9) (pred_7 ?v11) 
                  (pred_10 ?v9) (pred_12 ?v11 ?v9) (pred_6 ))
:effect (and (pred_3 ?v11)
   (not (pred_12 ?v11 ?v9)) (not (pred_6 ))))


(:action op_4
:parameters (?v9 ?v6 ?v2)
:precondition (and (pred_11 ?v9) (pred_7 ?v6) (pred_7 ?v2)
                  (pred_10 ?v9) (pred_3 ?v2) (pred_12 ?v6 ?v9))
:effect (and (pred_3 ?v6) (pred_12 ?v2 ?v9)
        (not (pred_3 ?v2)) (not (pred_12 ?v6 ?v9))))

(:action op_3
:parameters (?v9 ?v11)
:precondition (and (pred_11 ?v9) (pred_7 ?v11) 
                  (pred_10 ?v9) (pred_3 ?v11))
:effect (and (pred_6 ) (pred_12 ?v11 ?v9) (not (pred_3 ?v11)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_22 obj_07 obj_11 obj_19 obj_15 obj_12 obj_01 obj_20 obj_05 obj_13 obj_17 obj_04 obj_10 obj_08 obj_06
    obj_14 obj_16 obj_09
    obj_02 obj_03 obj_21
    )

    (:init
       (pred_6)

       (pred_11 obj_18)
       (pred_11 obj_22)
       (pred_11 obj_07)
       (pred_11 obj_11)
       (pred_11 obj_19)
       (pred_11 obj_15)
       (pred_11 obj_12)
       (pred_11 obj_01)
       (pred_11 obj_20)
       (pred_11 obj_05)
       (pred_11 obj_13)
       (pred_11 obj_17)
       (pred_11 obj_04)
       (pred_11 obj_10)
       (pred_11 obj_08)
       (pred_11 obj_06)
       (pred_9 obj_14)
       (pred_9 obj_16)
       (pred_9 obj_09)
       (pred_7 obj_02)
       (pred_7 obj_03)
       (pred_7 obj_21)

       (pred_8 obj_18 obj_19)
       (pred_8 obj_18 obj_22)
       (pred_8 obj_22 obj_15)
       (pred_8 obj_22 obj_07)
       (pred_8 obj_22 obj_18)
       (pred_8 obj_07 obj_12)
       (pred_8 obj_07 obj_11)
       (pred_8 obj_07 obj_22)
       (pred_8 obj_11 obj_01)
       (pred_8 obj_11 obj_07)
       (pred_8 obj_19 obj_20)
       (pred_8 obj_19 obj_15)
       (pred_8 obj_19 obj_18)
       (pred_8 obj_15 obj_05)
       (pred_8 obj_15 obj_12)
       (pred_8 obj_15 obj_22)
       (pred_8 obj_15 obj_19)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_12 obj_01)
       (pred_8 obj_12 obj_07)
       (pred_8 obj_12 obj_15)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_01 obj_11)
       (pred_8 obj_01 obj_12)
       (pred_8 obj_20 obj_04)
       (pred_8 obj_20 obj_05)
       (pred_8 obj_20 obj_19)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_05 obj_15)
       (pred_8 obj_05 obj_20)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_17)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_13 obj_05)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_04 obj_20)
       (pred_8 obj_10 obj_08)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_08 obj_06)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_08 obj_10)
       (pred_8 obj_06 obj_17)
       (pred_8 obj_06 obj_08)
       (pred_4 obj_15)
       (pred_4 obj_12)
       (pred_4 obj_04)
       (pred_2  obj_15 obj_14)
       (pred_2  obj_12 obj_16)
       (pred_2  obj_04 obj_09)
       (pred_1 obj_18)
       (pred_1 obj_22)
       (pred_1 obj_07)
       (pred_1 obj_11)
       (pred_1 obj_19)
       (pred_1 obj_01)
       (pred_1 obj_20)
       (pred_1 obj_05)
       (pred_1 obj_13)
       (pred_1 obj_17)
       (pred_1 obj_10)
       (pred_1 obj_08)
       (pred_1 obj_06)

       (pred_5  obj_02 obj_14)
       (pred_5  obj_03 obj_16)
       (pred_5  obj_21 obj_09)
       (pred_12 obj_02 obj_18)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_21 obj_06)
       (pred_10 obj_06)
    )

    (:goal (and
       (pred_12 obj_03 obj_20)
    ))
(:constraints
  (always (not (pred_10 obj_13)))
)
)

; plan
1. (op_5 obj_06 obj_08)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_08)
   goals met: 0 of 1
2. (op_5 obj_08 obj_10)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_10)
   goals met: 0 of 1
3. (op_5 obj_10 obj_05)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_05)
   goals met: 0 of 1
4. (op_2 obj_05 obj_03)
   deleted: (pred_12 obj_03 obj_05) (pred_6)
   added: (pred_3 obj_03)
   goals met: 0 of 1
5. (op_5 obj_05 obj_20)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_20)
   goals met: 0 of 1
6. (op_3 obj_20 obj_03)
   deleted: (pred_3 obj_03)
   added: (pred_6) (pred_12 obj_03 obj_20)
   goals met: 1 of 1
